bonaventureli/ble_services/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hrs_sdk/main.c
}


static bool app_shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
switch (event)
    {
        case NRF_PWR_MGMT_EVT_PREPARE_DFU:
            NRF_LOG_INFO("Power management wants to reset to DFU mode.");
            // YOUR_JOB: Get ready to reset into DFU mode
            //
            // If you aren't finished with any ongoing tasks, return "false" to
            // signal to the system that reset is impossible at this stage.
            //
            // Here is an example using a variable to delay resetting the device.
            //
            // if (!m_ready_for_reset)
            // {
            //      return false;
            // }
            // else
            //{
            //
            //    // Device ready to enter
            //    uint32_t err_code;
            //    err_code = sd_softdevice_disable();
            //    APP_ERROR_CHECK(err_code);
            //    err_code = app_timer_stop_all();
            //    APP_ERROR_CHECK(err_code);
            //}
            break;

        default:
            // YOUR_JOB: Implement any of the other events available from the power management module:
            //      -NRF_PWR_MGMT_EVT_PREPARE_SYSOFF
            //      -NRF_PWR_MGMT_EVT_PREPARE_WAKEUP
            //      -NRF_PWR_MGMT_EVT_PREPARE_RESET
            return true;
    }

    NRF_LOG_INFO("Power management allowed to reset to DFU mode.");
    return true;
}
//lint -esym(528,m_app_shutdown_handler)
/*@brief Register application shutdown handler with priority 0. */
NRF_PWR_MGMT_HANDLER_REGISTER(app_shutdown_handler,0);
#include "ble_advertising.h"
static void advertising_config_get(ble_adv_modes_config_t * p_config)
{
    memset(p_config, 0, sizeof(ble_adv_modes_config_t));

    p_config->ble_adv_fast_enabled  = true;
    p_config->ble_adv_fast_interval = APP_ADV_INTERVAL;
    p_config->ble_adv_fast_timeout  = APP_ADV_DURATION;
}
static void disconnect(uint16_t conn_handle, void * p_context)
{
    UNUSED_PARAMETER(p_context);

    ret_code_t err_code = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_WARNING("Failed to disconnect connection. Connection handle: %d Error: %d", conn_handle, err_code);
    }
    else
    {
        NRF_LOG_DEBUG("Disconnected connection handle %d", conn_handle);
    }
}
// YOUR_JOB: Update this code if you want to do anything given a DFU event (optional).
/**@brief Function for handling dfu events from the Buttonless Secure DFU service
 *
 * @param[in]   event   Event from the Buttonless Secure DFU service.
 */
static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event)
{
	switch(event)
	{
		case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE:
			NRF_LOG_INFO("Device is preparing to enter bootloader mode.");
		
			// Prevent device from advertising on disconnect.
			ble_adv_modes_config_t config;
			advertising_config_get(&config);
			config.ble_adv_on_disconnect_disabled = true;
			ble_advertising_modes_config_set(&m_advertising, &config);

			// Disconnect all other bonded devices that currently are connected.
			// This is required to receive a service changed indication
			// on bootup after a successful (or aborted) Device Firmware Update.
			uint32_t conn_count = ble_conn_state_for_each_connected(disconnect, NULL);
			NRF_LOG_INFO("Disconnected %d links.", conn_count);
		break;
		case BLE_DFU_EVT_BOOTLOADER_ENTER:
			NRF_LOG_INFO("Device will enter bootloader mode.");
		break;
		case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
			NRF_LOG_INFO("Request to enter bootloader mode failed asynchroneously.");
		break;
		case BLE_DFU_EVT_RESPONSE_SEND_ERROR:
			NRF_LOG_INFO("Request to send a response to client failed.");
		break;
		default:
			NRF_LOG_INFO("Unknown event from ble_dfu_buttonless.");
			break;
		
	}
}
/*rssi*/
static double Q = 0.001f;        // ????,???????????
static double R = 0.1f;         // ????,??????????

static double xhatminus;     // ????????,?k-1??,?k?????????
static double rssi_pre = 0;      // k-1??????
static double rssi_deal_end;
static double Pminus;        // ???????
static double P_pre;         // ???????????????
static double K;             // ?????,??????????????(???????????????????)?????
static double PP;            // ????
static uint8_t rssi_data[10] = {0};
static int b = 0;
static uint8_t rssi;
static int in_car = 0;
void bubblesort(uint8_t a[], uint8_t n)
{
    int i;
    int j;//?????????
    int maxer;
    /*????“??”???,????????*/
    for(i=n-2;i>=0;i--){
        for(j=0;j<=i;j++){
            maxer=a[j];
            if(maxer>=a[j+1]){
                /*????????????,????*/
                a[j]=a[j+1];
                a[j+1]=maxer;
            }
        }
    }
}

int meansDoRssi(uint8_t *bleNodeInfo, uint8_t len)
{
    int rssiTmp = 0, dealEndRssi = 0;
    int i = 0, actualCollectNumber = 0;

    bubblesort(bleNodeInfo, len);

    for(i = 0; i < (len-3); i++)
    {
        rssiTmp += bleNodeInfo[i];
        //actualCollectNumber++;
        //bleNodeInfo[i] = 0;
    }
    //rssiTmp = bleNodeInfo[1]+bleNodeInfo[2]+bleNodeInfo[3]+bleNodeInfo[4]+bleNodeInfo[5]+bleNodeInfo[6]+bleNodeInfo[7]+bleNodeInfo[8];
    dealEndRssi = rssiTmp/(len-3);
    rssiTmp = 0;
    return dealEndRssi;
}
double kalmanFilteringDoRssi(double rssi)
{
    rssi_deal_end = rssi;
    xhatminus = rssi_pre;
    // ????????????????????????????
    Pminus = P_pre + Q;
    //?????,??????????????(???????????????????)?????
    K = Pminus / (Pminus + R);
    //????????,????????????,??????????,??????????
    rssi_deal_end = xhatminus + K * (rssi_deal_end - xhatminus);
    //??????????
    PP = (1 - K) * Pminus;
    rssi_pre = rssi_deal_end;
    //DBG_LOG("rssi_deal_end = %.3f rssi_pre = %.3f" , rssi_deal_end, rssi_pre);
    P_pre = PP;

    return rssi_deal_end;

}
void Handle_Rssi(uint8_t rssi){


    //uint8_t rssi = meansDoRssi(rssi_data+4, ahead_num);

    //DEBUG("rssi:");DEBUG((uint8_t*)convInt32ToText(rssi)); DEBUG("\r\n");

    double rssivalue = kalmanFilteringDoRssi((double)rssi);
    uint8_t temp_rssi = (uint8_t)rssivalue;
		rssi_data[b] = temp_rssi;
		b++;
		//DEBUG("RSSI:"); DEBUG((uint8_t*)convInt32ToText((int)rssi)); DEBUG_NEWLINE();
		if(b ==10){
				rssi = meansDoRssi(rssi_data, 10);
				memset(rssi_data, 0, 10);
			    NRF_LOG_INFO("rssi = %d ",rssi);
				if((rssi > 0 )&&(rssi <= 53 )){
					in_car = 2;//PS
				    NRF_LOG_INFO("in_car.%d ", rssi);
				}else if((rssi > (53) )&&(rssi <= 75)){
					in_car = 3;//PE
					  NRF_LOG_INFO("out_car %d .",rssi);
				} 
				else
				{
					 in_car = 0;
					 NRF_LOG_INFO("nk car status %d.",rssi);

