bonaventureli/ble_services/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hrs_sdk/main.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    ret_code_t err_code;

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    ret_code_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            NRF_LOG_INFO("Fast advertising.");
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_ADV_EVT_IDLE:
            sleep_mode_enter();
            break;

        default:
            break;
    }
}
void Handle_active()
{
	#if 1
	NRF_LOG_INFO("Handle_active function");
	uint8_t *preply_data;
	unsigned int outlen;
//	preply_data = gDataload;
	
	//ingeek_se_final();
	//ingeek_se_init();
	uint8_t status;
	
	status = ingeek_get_sec_status();
	ble_send_notify(BLE_UUID_DIGITALKET_STATUS_CHAR, &status, 1);
	
		if(ingeek_pull_info(gReturnInfo, &gReturnInfoLen) != SUCCESS){
		//if(ingeek_pull_info(preply_data, &outlen) != SUCCESS){
		
		NRF_LOG_INFO("Handle_active:ingeek_pull_info Not Success");
		return;
	}
	else{
		if(gReturnInfoLen != 29){
			NRF_LOG_INFO("Handle_active:outlen != 29");
			return;
		}
		else{
			NRF_LOG_INFO("Handle_active:ingeek_pull_info Success");
			ble_send_notify(BLE_UUID_DIGITALKET_INFO_CHAR, gReturnInfo, gReturnInfoLen);
		}
	}
	#endif
}

void Handle_broadcast()
{
	int ret;
	NRF_LOG_INFO("Handle_broadcast function==========");
	ret = ingeek_get_sec_status();
	if(ret == 0xFF){
		NRF_LOG_INFO("status %x",ret);
		return;
	}
	#if 0
	if((ret >= 0)&&(ret < 0xFF)){
		NRF_LOG_INFO("status %x",ret);
		Handle_active();
	}
	#endif
	if((ret == 0) || (ret == 0x01)){
		Handle_active();
	}
}
void Handle_disconnect()
{
	int ret;
	
	#if 0
	if((ret == 0x00)||(ret == 0x01)){
		NRF_LOG_INFO("status %x",ret);
	}
	else{
	ingeek_se_final();
		NRF_LOG_INFO("ingeek_se_final");
	}
	#endif
	
	ingeek_se_final();
	ret = ingeek_get_sec_status();
	NRF_LOG_INFO("status %x",ret);
	NRF_LOG_INFO("Handle_disconnect function==========");
	
	return;
}
#define IO_CAPS      BLE_GAP_IO_CAPS_DISPLAY_ONLY  
#define BOND         0                              
#define OOB          0                          
#define MITM         1

void resp_pair_request(){
  ble_gap_sec_params_t sec_params;
	uint32_t err_code;
	memset(&sec_params,0,sizeof(ble_gap_sec_params_t));

	sec_params.bond = BOND;
	sec_params.oob = BOND;
	sec_params.mitm = MITM;
	sec_params.io_caps = IO_CAPS;
		
	sec_params.max_key_size = 16;
	sec_params.min_key_size = 7;
		
	err_code=sd_ble_gap_sec_params_reply(m_conn_handle,BLE_GAP_SEC_STATUS_SUCCESS,&sec_params,NULL);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */

static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected.");
				/*rssi*/
						sd_ble_gap_rssi_start(m_conn_handle,0,0);
						err_code = app_timer_start(rssi_timer, 1000, NULL);
						APP_ERROR_CHECK(err_code);
				
						Handle_broadcast();
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected, reason %d.",
                          p_ble_evt->evt.gap_evt.params.disconnected.reason);
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
				/*rssi*/
						sd_ble_gap_rssi_stop(m_conn_handle);
						err_code = app_timer_stop(rssi_timer);
						APP_ERROR_CHECK(err_code);
				
						Handle_disconnect();
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;
    
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            NRF_LOG_INFO("BLE_GAP_EVT_SEC_PARAMS_REQUEST");
						//resp_pair_request();
            break;
        
        case BLE_GAP_EVT_AUTH_KEY_REQUEST:
            NRF_LOG_INFO("BLE_GAP_EVT_AUTH_KEY_REQUEST");
            break;

        case BLE_GAP_EVT_LESC_DHKEY_REQUEST:
            NRF_LOG_INFO("BLE_GAP_EVT_LESC_DHKEY_REQUEST");
            break;

         case BLE_GAP_EVT_AUTH_STATUS:
             NRF_LOG_INFO("BLE_GAP_EVT_AUTH_STATUS: status=0x%x bond=0x%x lv4: %d kdist_own:0x%x kdist_peer:0x%x",
                          p_ble_evt->evt.gap_evt.params.auth_status.auth_status,
                          p_ble_evt->evt.gap_evt.params.auth_status.bonded,
                          p_ble_evt->evt.gap_evt.params.auth_status.sm1_levels.lv4,
                          *((uint8_t *)&p_ble_evt->evt.gap_evt.params.auth_status.kdist_own),
                          *((uint8_t *)&p_ble_evt->evt.gap_evt.params.auth_status.kdist_peer));
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

