bonaventureli/ble_services/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hrs_sdk/main.c
static int storageReadData(uint8_t *outBuf, uint32_t word_count, uint32_t offset)
{
    uint32_t err_code;
    if (NULL == outBuf)
        return 0;

    if ((offset >= 1024) || (word_count + offset > 1024))
        return 0;
        
    err_code = fstorage_data_read(offset, outBuf, word_count);
    if (NRF_SUCCESS != err_code)
    {
        return 0;
    }

    return 0;
}

static int storageWriteData(const uint8_t *inBuf, uint32_t word_count,uint32_t offset)
{
    uint32_t err_code;
    
    if (NULL == inBuf)
        return 0;

    if ((offset >= 1024) || (word_count + offset > 1024))
        return 0;
        
    err_code = fstorage_data_write(offset, inBuf, word_count);
    if (NRF_SUCCESS != err_code)
    {
        return 0;
    }

    return 0;
}
#endif

#if 0
static int ikif_uart_txcb( const uint8_t *msg, uint32_t wlen, uint32_t offset )
{
    int ret;
    //NRF_LOG_INFO("ikif_uart_txcb tx %d bytes", wlen);
    
    ret = m2m_if_UartSendData((uint8_t *)msg, (uint16_t)wlen);
    if (wlen != ret)
    {
        NRF_LOG_WARNING("m2m_if_UartSendData send Failed, req=%d, sended=%d", wlen, ret);
    }
    
    return ret;
}
#endif

#include <stdlib.h>

uint16_t lcrc16_compute(uint8_t const * p_data, uint32_t size, uint16_t const * p_crc)
{
    uint16_t crc = (p_crc == NULL) ? 0xFFFF : *p_crc;

    for (uint32_t i = 0; i < size; i++)
    {
        crc  = (uint8_t)(crc >> 8) | (crc << 8);
        crc ^= p_data[i];
        crc ^= (uint8_t)(crc & 0xFF) >> 4;
        crc ^= (crc << 8) << 4;
        crc ^= ((crc & 0xFF) << 4) << 1;
    }

    return crc;
}

static bool lcrc_verify_success(uint16_t crc, uint16_t len_words, uint8_t const * const p_data)
{
    uint16_t computed_crc;

    // The CRC is computed on the entire record, except the CRC field itself.
    // The record header is 12 bytes, out of these we have to skip bytes 6 to 8 where the
    // CRC itself is stored. Then we compute the CRC for the rest of the record, from byte 8 of
    // the header (where the record ID begins) to the end of the record data.
    computed_crc = lcrc16_compute((uint8_t const *)p_data, len_words, NULL);
		//computed_crc = lcrc16_compute((uint8_t const *)p_data,  6, NULL);
    //computed_crc = lcrc16_compute((uint8_t const *)p_data + 8, (len_words) * sizeof(uint8_t),&computed_crc);

    return (computed_crc == crc);
}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

		uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
	
		fstorage_data_init(); //change 2018/12/24 lifei
	
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    //sensor_simulator_init();
    conn_params_init();
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("started %s",DEVICE_NAME);
    application_timers_start();
    advertising_start(erase_bonds);
		
		#if 1/*crc*/
		#include "crc16.h"
		
		uint8_t data[20]={0x12,0x22,0x44,0x55,0x23,0x7E,0x7F,0x7D,0x77,0x89,0x76,0x55,0x44,0x34,0x57,0x66,0x78,0x23,0x34,0x45};
		uint16_t gcrc16;
		//uint8_t *data2;
		uint8_t data2[25];
		uint8_t data3[25];
		uint32_t data2_len;
		uint32_t data3_len;
		#include "convert.h"
		Escape_frame_data(data, sizeof(data), data2, &data2_len);
		//NRF_LOG_INFO("data2_len: %d",data2_len);
		//NRF_LOG_HEXDUMP_INFO(data2, data2_len);	
			
		Reduction_frame_data(data2, data2_len, data3, &data3_len);
		NRF_LOG_INFO("data3_len: %d",data3_len);
		NRF_LOG_HEXDUMP_INFO(data3, data3_len);	
			
		gcrc16 = lcrc16_compute((uint8_t const *)data, sizeof(data), NULL);

		if (!lcrc_verify_success(gcrc16,sizeof(data),data)){
		NRF_LOG_INFO("lcrc_verify_unsuccess");
		}
		NRF_LOG_INFO("lcrc_verify_success %x",gcrc16);
		
		#endif
		
		#if 0
		fstorage_data_erase(0);
		#endif
		
		#if 1
		ingeek_set_callback(read_CB1,write_CB1,Rand_CB1);
		#else
		ingeek_set_callback(storageReadData,storageWriteData,ikif_random_vector_generate);
		#endif
		ingeek_se_init();
		
		uint8_t status;
		status = ingeek_get_sec_status();
		NRF_LOG_INFO("started %x",status);
		NotifyCallBack(ble_send_notify);
		
		printf("\r\nUART started.\r\n");

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


